In [1]:
import numpy as np
import pandas as pd

In [2]:
movies = pd.read_csv('titles.csv')
credits = pd.read_csv('credits.csv')

In [3]:
movies.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,1945,TV-MA,51,['documentation'],['US'],1.0,NaN,NaN,NaN,0.600,NaN
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,1976,R,114,"['drama', 'crime']",['US'],NaN,tt0075314,8.2,808582.0,40.965,8.179
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,1972,R,109,"['drama', 'action', 'thriller', 'european']",['US'],NaN,tt0068473,7.7,107673.0,10.010,7.300
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...",1975,PG,91,"['fantasy', 'action', 'comedy']",['GB'],NaN,tt0071853,8.2,534486.0,15.461,7.811
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,1967,NaN,150,"['war', 'action']","['GB', 'US']",NaN,tt0061578,7.7,72662.0,20.398,7.600

In [4]:
movies.shape

(5850, 15)

In [5]:
movies = movies[['id', 'title', 'type','description', 'genres']]
movies.head()

,id,title,type,description,genres
0,ts300399,Five Came Back: The Reference Films,SHOW,This collection includes 12 World War II-era p...,['documentation']
1,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,"['drama', 'crime']"
2,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,"['drama', 'action', 'thriller', 'european']"
3,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...","['fantasy', 'action', 'comedy']"
4,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,"['war', 'action']"

In [6]:
credits.head()

   person_id       id             name                character   role
0       3748  tm84618   Robert De Niro            Travis Bickle  ACTOR
1      14658  tm84618     Jodie Foster            Iris Steensma  ACTOR
2       7064  tm84618    Albert Brooks                      Tom  ACTOR
3       3739  tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
4      48933  tm84618  Cybill Shepherd                    Betsy  ACTOR

In [7]:
credits = credits.groupby('id').agg(
    {'name': list,
     'character': list,
     'role':list}
).reset_index()

In [8]:
credits.head()

,id,name,character,role
0,tm1000037,"[Luna Wedler, Jannis Niewöhner, Milan Peschel,...","[Maxi, Karl, Alex, Ante, Jitka, Pankraz, Didie...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT..."
1,tm1000147,"[Guy Pearce, Matilda Anna Ingrid Lutz, Travis ...","[David Carmichael, Jane, Marlon Veidt, Joseph ...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT..."
2,tm100015,"[Idris Elba, Paul Walker, Matt Dillon, Michael...","[Gordon Jennings, John Rahway, Jack Welles, Ja...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT..."
3,tm1000166,"[Glenn Fredly, Marcello Tahitoe, Andien Aisyah...","[Himself, Himself, Herself, Herself, Himself, ...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, DIR..."
4,tm1000185,"[Adrianna Chlebicka, Mateusz Banasiuk, Mirosła...","[Monika/Klaudia, Enzo, Ojciec Moniki, Ilona, J...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT..."

In [9]:
movies = movies.merge(credits,on='id')
movies.head()

,id,title,type,description,genres,name,character,role
0,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,"['drama', 'crime']","[Robert De Niro, Jodie Foster, Albert Brooks, ...","[Travis Bickle, Iris Steensma, Tom, Matthew 'S...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT..."
1,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,"['drama', 'action', 'thriller', 'european']","[Jon Voight, Burt Reynolds, Ned Beatty, Ronny ...","[Ed Gentry, Lewis Medlock, Bobby Trippe, Drew ...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT..."
2,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...","['fantasy', 'action', 'comedy']","[Graham Chapman, John Cleese, Eric Idle, Terry...",[King Arthur / Voice of God / Middle Head / Hi...,"[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT..."
3,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,"['war', 'action']","[Lee Marvin, Ernest Borgnine, Charles Bronson,...","[Maj. John Reisman, Maj. Gen. Worden, Joseph W...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT..."
4,ts22164,Monty Python's Flying Circus,SHOW,A British sketch comedy series with the shows ...,"['comedy', 'european']","[Graham Chapman, Michael Palin, Terry Jones, E...","[Various, Various / ""It's"" man, Various, Vario...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR]"

In [10]:
count  = 0
for i in range (0, len(credits)):
    j = len(credits['role'][i])
    for k in range(0,j):
        if(credits['role'][i][k]) == 'DIRECTOR':
            count += 1

In [11]:
movies['director'] = [[]] * len(movies)

In [12]:
for i in range (0, len(movies)):
    j = len(movies['character'][i])
    movies['director'][i] = [movies['name'][i][j-1]]

In [13]:
movies.head()

,id,title,type,description,genres,name,character,role,director
0,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,"['drama', 'crime']","[Robert De Niro, Jodie Foster, Albert Brooks, ...","[Travis Bickle, Iris Steensma, Tom, Matthew 'S...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT...",[Martin Scorsese]
1,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,"['drama', 'action', 'thriller', 'european']","[Jon Voight, Burt Reynolds, Ned Beatty, Ronny ...","[Ed Gentry, Lewis Medlock, Bobby Trippe, Drew ...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT...",[John Boorman]
2,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...","['fantasy', 'action', 'comedy']","[Graham Chapman, John Cleese, Eric Idle, Terry...",[King Arthur / Voice of God / Middle Head / Hi...,"[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT...",[Terry Gilliam]
3,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,"['war', 'action']","[Lee Marvin, Ernest Borgnine, Charles Bronson,...","[Maj. John Reisman, Maj. Gen. Worden, Joseph W...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACTOR, ACT...",[Robert Aldrich]
4,ts22164,Monty Python's Flying Circus,SHOW,A British sketch comedy series with the shows ...,"['comedy', 'european']","[Graham Chapman, Michael Palin, Terry Jones, E...","[Various, Various / ""It's"" man, Various, Vario...","[ACTOR, ACTOR, ACTOR, ACTOR, ACTOR]",[Terry Gilliam]

In [14]:
movies = movies.drop('character', axis=1)
movies = movies.drop('role', axis=1)
movies.head()

,id,title,type,description,genres,name,director
0,tm84618,Taxi Driver,MOVIE,A mentally unstable Vietnam War veteran works ...,"['drama', 'crime']","[Robert De Niro, Jodie Foster, Albert Brooks, ...",[Martin Scorsese]
1,tm154986,Deliverance,MOVIE,Intent on seeing the Cahulawassee River before...,"['drama', 'action', 'thriller', 'european']","[Jon Voight, Burt Reynolds, Ned Beatty, Ronny ...",[John Boorman]
2,tm127384,Monty Python and the Holy Grail,MOVIE,"King Arthur, accompanied by his squire, recrui...","['fantasy', 'action', 'comedy']","[Graham Chapman, John Cleese, Eric Idle, Terry...",[Terry Gilliam]
3,tm120801,The Dirty Dozen,MOVIE,12 American military prisoners in World War II...,"['war', 'action']","[Lee Marvin, Ernest Borgnine, Charles Bronson,...",[Robert Aldrich]
4,ts22164,Monty Python's Flying Circus,SHOW,A British sketch comedy series with the shows ...,"['comedy', 'european']","[Graham Chapman, Michael Palin, Terry Jones, E...",[Terry Gilliam]

In [15]:
# Considering only top 5 actors in the list 
for i in range (0, len(movies)):
    movies['name'][i] = movies['name'][i][:5]

In [16]:
movies['name'][0]

['Robert De Niro',
 'Jodie Foster',
 'Albert Brooks',
 'Harvey Keitel',
 'Cybill Shepherd']

In [17]:
movies['description'] = movies['description'].apply(lambda x:x.split() if isinstance(x, str) else [])

In [18]:
movies['description']

0       [A, mentally, unstable, Vietnam, War, veteran,...
1       [Intent, on, seeing, the, Cahulawassee, River,...
2       [King, Arthur,, accompanied, by, his, squire,,...
3       [12, American, military, prisoners, in, World,...
4       [A, British, sketch, comedy, series, with, the...
                              ...
5484    [In, 14th-century, Mali,, an, ambitious, young...
5485    [Reese, is, a, con, artist, from, Manila, who,...
5486    [The, story, follows, a, young, man, and, woma...
5487    [A, beautiful, love, story, that, can, happen,...
5488    [A, controversial, TV, host, and, comedian, wh...
Name: description, Length: 5489, dtype: object

In [19]:
def collapse(L):
    L1 = []
    for i in L:
        L1.append(i.replace(" ",""))
    return L1

In [20]:
movies['description'] = movies['description'].apply(collapse)
# movies['genres'] = movies['genres'].apply(collapse)

In [21]:
movies['name'] = movies['name'].apply(collapse)

In [22]:
movies['name'][0]

['RobertDeNiro',
 'JodieFoster',
 'AlbertBrooks',
 'HarveyKeitel',
 'CybillShepherd']

In [23]:
movies['director'] = movies['director'].tolist()

In [24]:
movies['director'][0]

['Martin Scorsese']

In [25]:
movies['director'] = movies['director'].apply(collapse)

In [26]:
movies['director']

0       [MartinScorsese]
1          [JohnBoorman]
2         [TerryGilliam]
3        [RobertAldrich]
4         [TerryGilliam]
              ...
5484         [JoePenney]
5485     [BarryGonzalez]
5486      [MohamedBakir]
5487      [SeyiBabatope]
5488     [JulianGaviria]
Name: director, Length: 5489, dtype: object

In [27]:
movies['tags'] = movies.apply(lambda row: [row['type'], row['description'], row['genres'], row['name'], row['director']], axis=1)

In [28]:
final_data = movies.drop(columns=['type', 'description', 'genres', 'name', 'director'])

In [29]:
print([final_data['tags'][0][0]])
print(final_data['tags'][0][1])
print(final_data['tags'][0][2])
print(final_data['tags'][0][3])
print(final_data['tags'][0][4])

['MOVIE']
['A', 'mentally', 'unstable', 'Vietnam', 'War', 'veteran', 'works', 'as', 'a', 'night-time', 'taxi', 'driver', 'in', 'New', 'York', 'City', 'where', 'the', 'perceived', 'decadence', 'and', 'sleaze', 'feed', 'his', 'urge', 'for', 'violent', 'action.']
['drama', 'crime']
['RobertDeNiro', 'JodieFoster', 'AlbertBrooks', 'HarveyKeitel', 'CybillShepherd']
['MartinScorsese']

In [30]:
for i in range (0, len(final_data['tags'])):
    final_data['tags'][i][0] = [final_data['tags'][i][0]]

In [31]:
final_data['tags'][0]

[['MOVIE'],
 ['A',
  'mentally',
  'unstable',
  'Vietnam',
  'War',
  'veteran',
  'works',
  'as',
  'a',
  'night-time',
  'taxi',
  'driver',
  'in',
  'New',
  'York',
  'City',
  'where',
  'the',
  'perceived',
  'decadence',
  'and',
  'sleaze',
  'feed',
  'his',
  'urge',
  'for',
  'violent',
  'action.'],
 "['drama', 'crime']",
 ['RobertDeNiro',
  'JodieFoster',
  'AlbertBrooks',
  'HarveyKeitel',
  'CybillShepherd'],
 ['MartinScorsese']]

In [32]:
for i in  range (0, len(final_data['tags'])):
    merged = []

    for sublist in final_data['tags'][i]:
        merged.extend(sublist)

    final_data['tags'][i].clear()
    final_data['tags'][i].extend(merged)

In [33]:
final_data['tags'] = final_data['tags'].apply(lambda x: " ".join(x))

In [34]:
final_data.head()

,id,title,tags
0,tm84618,Taxi Driver,MOVIE A mentally unstable Vietnam War veteran ...
1,tm154986,Deliverance,MOVIE Intent on seeing the Cahulawassee River ...
2,tm127384,Monty Python and the Holy Grail,"MOVIE King Arthur, accompanied by his squire, ..."
3,tm120801,The Dirty Dozen,MOVIE 12 American military prisoners in World ...
4,ts22164,Monty Python's Flying Circus,SHOW A British sketch comedy series with the s...

In [35]:
from sklearn.feature_extraction.text import CountVectorizer
cv = CountVectorizer(max_features=5000,stop_words='english')

In [36]:
vector = cv.fit_transform(final_data['tags']).toarray()

In [37]:
vector.shape

(5489, 5000)

In [38]:
from sklearn.metrics.pairwise import cosine_similarity

In [39]:
similarity = cosine_similarity(vector)
similarity

array([[1.        , 0.05407381, 0.02837522, ..., 0.05407381, 0.07856742,
        0.06085806],
       [0.05407381, 1.        , 0.02761841, ..., 0.05263158, 0.07647191,
        0.05923489],
       [0.02837522, 0.02761841, 1.        , ..., 0.02761841, 0.04012862,
        0.03108349],
       ...,
       [0.05407381, 0.05263158, 0.02761841, ..., 1.        , 0.22941573,
        0.11846978],
       [0.07856742, 0.07647191, 0.04012862, ..., 0.22941573, 1.        ,
        0.0860663 ],
       [0.06085806, 0.05923489, 0.03108349, ..., 0.11846978, 0.0860663 ,
        1.        ]])

In [40]:
def recommend(movie):
    index = final_data[final_data['title'] == movie].index[0]
    distances = sorted(list(enumerate(similarity[index])),reverse=True,key = lambda x: x[1])
    for i in distances[1:6]:
        print(final_data.iloc[i[0]].title)

In [43]:
recommend('Half Girlfriend')

Humpty Sharma Ki Dulhania
Ante... Sundaraniki!
Sweet Tooth
Shimla Mirchi
Kiss of Life

In [44]:
import pickle

In [46]:
pickle.dump(final_data, open('movies_list.pkl', 'wb'))

In [50]:
pickle.dump(similarity, open('similarity.pkl', 'wb'))

In [49]:
pickle.load(open('movies_list.pkl', 'rb'))

,id,title,tags
0,tm84618,Taxi Driver,MOVIE A mentally unstable Vietnam War veteran ...
1,tm154986,Deliverance,MOVIE Intent on seeing the Cahulawassee River ...
2,tm127384,Monty Python and the Holy Grail,"MOVIE King Arthur, accompanied by his squire, ..."
3,tm120801,The Dirty Dozen,MOVIE 12 American military prisoners in World ...
4,ts22164,Monty Python's Flying Circus,SHOW A British sketch comedy series with the s...
...,...,...,...
5484,tm1216735,Sun of the Soil,"MOVIE In 14th-century Mali, an ambitious young..."
5485,tm985215,Princess 'Daya'Reese,MOVIE Reese is a con artist from Manila who dr...
5486,tm1097142,My Bride,MOVIE The story follows a young man and woman ...
5487,tm1014599,Fine Wine,MOVIE A beautiful love story that can happen b...
5488,tm1059008,Lokillo,MOVIE A controversial TV host and comedian who...